__*Задача.*__
Написать программу, которая из имеющегося массива строк сформирует массив из строк, длина которых меньше либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполенения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

__*Решение:*__

1.Составляем блок схему алгоритма решения задачи.

2. Создаем массив 1 ранга с данными типа *string*:

    string [] array = new string[]{ "++", "Russia", "Great", "Country", "!" "++" }

3. Создаем временную переменную *str* типа *string* для хранения строки по каждому индексу массива.

4. Создаем переменную *lengthStr* с типом *int* для указания минимального количества символов в строке при котором будет производиться вывод строки в консоль.

    int lengthStr = 3;

5. Создаем цикл *for* для перебора каждого индекса в массиве. В цикле вводим условие,
при котором будет производиться вывод строк массива в консоль.

    if (str.Length <= lengthStr)

    {

    Console.Write($" {array[i]} ");

    }

6 Полный код программы приведен ниже:

    string[] array = new string[] { "++", "Russia", "Great", "Country", "!", "++" };
    string str = String.Empty;
    int lengthStr = 3;

    for (int i = 0; i < array.Length; i++)
    {
    str = array[i];


    if (str.Length <= lengthStr)
    {
        Console.Write($" {array[i]} ");
    }


    }